export const generalOptions = {
    ticker: [
        'Si курс доллар США-российский рубль',
        'BR нефть BRENT',
        'RI Индекс PTC',
        'Eu курс евро-российский рубль',
        'MX Индекс МосБиржи',
        'MM Индекс МосБиржи (мини)',
        'SR обыкновенные акции ПАО Сбербанк',
        'GZ обыкновенные акции ПАО "Газпром"',
        'LK обыкновенные акции ПАО "НК "ЛУКОЙЛ"',
        'VB обыкновенные акции Банк ВТБ (ПАО)',
        'RN обыкновенные акции ПАО "НК "Роснефть"',
        'MN обыкновенные акции ПАО "Магнит"',
        'AF обыкновенные акции ПАО "Аэрофлот"',
        'AL обыкновенные акции АК "АЛРОСА"',
        'SN обыкновенные акции ПАО "Сургутнефтегаз"',
        'TT обыкновенные акции ПАО "Татнефть"',
        'SP привилегированные акции ПАО Сбербанк',
        'NM обыкновенные акции ПАО "НЛМК"',
        'HY обыкновенные акции ПАО "РусГидро"',
        'ME обыкновенные акции ПАО Московская Биржа',
        'GK обыкновенные акции ГМК "Норильский никель"',
        'MG ПАО "Магнитогорский металлургический комбинат","Магнитогорск.мет.комб" ПАО ао',
        'ML гдр Мэйл.ру Груп',
        'VI волатильность российского рынка',
        'CR курс юань - российский рубль',
        'CNYRUBF юань вечный фьючерс',
        'USDRUBF доллар вечный фьючерс',
        'EURRUBF евро вечный фьючерс',
        'IMOEXF IMOEX вечный фьючерс',
        'GLDRUBF золото вечный фьючерс',
        'SBERF сбер вечный фьючерс',
        'GAZPF газпром вечный фьючерс',
        'RM PTC (мини)',
        'RB Индекс RGBI',
        'NK НОВАТЭК',
        'GL золото',
        'TN T Банк',
        'X5 X5',
        'YD ЯНДЕКС',
        'MY Индекс МосБиржи в юанях',
        'HS Hong Kong ETF',
        "W4 W4"
    ],
    participantTypes: [
        "Individuals & Companies", "Individuals", "Companies"
    ],
    dataTypes: [
        "Number of contracts",
        "Number of traders"
    ]
    // select3: [
    //     "Option -100", "Option 11"
    // ],
    // select4: [
    //     "Option 302", "Option 324uo4"
    // ]
};

export const initialGeneralValues = {
    ticker: "SR обыкновенные акции ПАО Сбербанк",
    participantTypes: "Individuals & Companies",
    dataTypes: "Number of contracts"
    // select3: "Option -100",
    // select4: "Option 302"
};
